utn/sintaxis.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-20 mié 17:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Sintaxis</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jelou" />
<link rel="stylesheet" type="text/css" href="themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="themes/styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="manu-theme/custom.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Sintaxis</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5c53dc9">Informacion</a></li>
<li><a href="#org9f3814e">Trabajos Practicos</a>
<ul>
<li><a href="#org8e884e0"><span class="todo _TODO_">[TODO]</span> Actividad C 3: Control de flujo</a></li>
<li><a href="#orga57f0c8"><span class="todo _TODO_">[TODO]</span> Actividad: Sintaxis de direcciones de correo electronico&#xa0;&#xa0;&#xa0;<span class="tag"><span class="sintaxis">sintaxis</span></span></a></li>
<li><a href="#org60cc2c7"><span class="todo _WAITING_">[WAITING]</span> Actividad 5 A: Expresiones Regulares&#xa0;&#xa0;&#xa0;<span class="tag"><span class="sintaxis">sintaxis</span></span></a></li>
<li><a href="#orgc5e5f31"><span class="done _DONE_">[DONE]</span> Actividad 4: Sintaxis y Semantica&#xa0;&#xa0;&#xa0;<span class="tag"><span class="sintaxis">sintaxis</span></span></a></li>
<li><a href="#org0c80d5d"><span class="todo _WAITING_">[WAITING]</span> Actividad 3 - BNF&#xa0;&#xa0;&#xa0;<span class="tag"><span class="sintaxis">sintaxis</span></span></a></li>
<li><a href="#orgf9e3116"><span class="todo _WAITING_">[WAITING]</span> Reentrega - Actividad 2 - Gramaticas&#xa0;&#xa0;&#xa0;<span class="tag"><span class="sintaxis">sintaxis</span></span></a></li>
<li><a href="#orgd6f7916"><span class="todo _WAITING_">[WAITING]</span> Actividad C 2 - Tipos, Operadores y Expresiones&#xa0;&#xa0;&#xa0;<span class="tag"><span class="sintaxis">sintaxis</span></span></a></li>
<li><a href="#org615ac0d"><span class="todo _WAITING_">[WAITING]</span> Actividad C 2 - Ansi C&#xa0;&#xa0;&#xa0;<span class="tag"><span class="sintaxis">sintaxis</span></span></a></li>
<li><a href="#org1b1f0bc"><span class="done _DONE_">[DONE]</span> Actividad 1 - Lenguajes Formales&#xa0;&#xa0;&#xa0;<span class="tag"><span class="sintaxis">sintaxis</span></span></a></li>
<li><a href="#orgf5ee79c"><span class="done _DONE_">[DONE]</span> Actividad 1 - Ansi C&#xa0;&#xa0;&#xa0;<span class="tag"><span class="sintaxis">sintaxis</span></span></a></li>
<li><a href="#orga7fa91b"><span class="done _DONE_">[DONE]</span> Actividad 2 - Gramaticas&#xa0;&#xa0;&#xa0;<span class="tag"><span class="sintaxis">sintaxis</span></span></a></li>
</ul>
</li>
<li><a href="#orgb0cf0d7">Cronograma dictado</a></li>
</ul>
</div>
</div>
<p>
<a href="index.html"><b><b>Volver al inicio</b></b></a>
</p>

<div id="outline-container-org5c53dc9" class="outline-2">
<h2 id="org5c53dc9">Informacion</h2>
<div class="outline-text-2" id="text-org5c53dc9">
<ul class="org-ul">
<li><a href="https://classroom.google.com/u/1/c/NTM3Mjk2MjYyNjZa"> <b><b>Aula Virtual</b></b> Bender (Google Classes)</a></li>
<li><a href="https://us04web.zoom.us/j/144552585"><b><b>Clase Virtual</b></b> por Zuñiga - Miercoles 19:00pm</a> (Clave: K2053)</li>
<li><a href="https://us04web.zoom.us/j/699789041?pwd=SWUzQTQ2cHBEYlFLS1VpVHZublV0UT09"><b><b>Clase Virtual</b></b> por Zuñiga - Jueves 8:00am</a> (Clave: K2004)</li>
</ul>
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2020-04-15 mié 19:00 +1w&gt;</span></span>
</p>
</div>
</div>

<div id="outline-container-org9f3814e" class="outline-2">
<h2 id="org9f3814e">Trabajos Practicos</h2>
<div class="outline-text-2" id="text-org9f3814e">
</div>
<div id="outline-container-org8e884e0" class="outline-3">
<h3 id="org8e884e0"><span class="todo _TODO_">[TODO]</span> Actividad C 3: Control de flujo</h3>
<div class="outline-text-3" id="text-org8e884e0">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2020-05-27 mié&gt;</span></span></p>
<p>
<a href="https://classroom.google.com/u/2/c/NTM3Mjk2MjYyNjZa/a/ODQ3MzA0NDk5ODJa/details">Ir a la Tarea</a>
<a href="https://classroom.google.com/u/2/c/NTM3Mjk2MjYyNjZa/m/MTI0MzY5NTQ1MzA1/details">Ir a la Teoria</a>
</p>
</div>
</div>
<div id="outline-container-orga57f0c8" class="outline-3">
<h3 id="orga57f0c8"><span class="todo _TODO_">[TODO]</span> Actividad: Sintaxis de direcciones de correo electronico&#xa0;&#xa0;&#xa0;<span class="tag"><span class="sintaxis">sintaxis</span></span></h3>
<div class="outline-text-3" id="text-orga57f0c8">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2020-05-27 mié&gt;</span></span></p>
<p>
<a href="https://classroom.google.com/u/2/c/NTM3Mjk2MjYyNjZa/a/ODU3NzM1NTI1ODFa/details">Ir a la Tarea</a>
</p>
</div>
</div>
<div id="outline-container-org60cc2c7" class="outline-3">
<h3 id="org60cc2c7"><span class="todo _WAITING_">[WAITING]</span> Actividad 5 A: Expresiones Regulares&#xa0;&#xa0;&#xa0;<span class="tag"><span class="sintaxis">sintaxis</span></span></h3>
<div class="outline-text-3" id="text-org60cc2c7">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2020-05-16 sáb&gt;</span></span></p>
<ul class="org-ul">
<li><a href="https://classroom.google.com/u/2/c/NTM3Mjk2MjYyNjZa/m/OTkyMDQ4NDg3MDla/details">Ver Teoria en el Aula Virtual</a></li>
<li><a href="https://classroom.google.com/u/2/c/NTM3Mjk2MjYyNjZa/a/OTkyMDk0MDQ1OTRa/details">Ver TP en el Aula Virtual</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgc5e5f31" class="outline-3">
<h3 id="orgc5e5f31"><span class="done _DONE_">[DONE]</span> Actividad 4: Sintaxis y Semantica&#xa0;&#xa0;&#xa0;<span class="tag"><span class="sintaxis">sintaxis</span></span></h3>
<div class="outline-text-3" id="text-orgc5e5f31">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2020-05-16 sáb 17:31]</span></span></p>
<ul class="org-ul">
<li><a href="https://classroom.google.com/u/2/c/NTM3Mjk2MjYyNjZa/a/Nzk1MDA1ODk3MzBa/details">Ver Teoria en el Aula Virtual</a></li>
<li><a href="https://classroom.google.com/u/2/c/NTM3Mjk2MjYyNjZa/a/Nzk1MDA1ODk3MzBa/details">Ver TP en el Aula Virtual</a>
No era tarea, era para resolver en clase</li>
</ul>
</div>
</div>
<div id="outline-container-org0c80d5d" class="outline-3">
<h3 id="org0c80d5d"><span class="todo _WAITING_">[WAITING]</span> Actividad 3 - BNF&#xa0;&#xa0;&#xa0;<span class="tag"><span class="sintaxis">sintaxis</span></span></h3>
<div class="outline-text-3" id="text-org0c80d5d">
<p>
<a href="https://classroom.google.com/u/2/c/NTM3Mjk2MjYyNjZa/a/NzU0NjgzNjYyODFa/details">Ir a la Tarea (Google Classes)</a>
DEADLINE: <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-04-19 dom&gt;</span></span>
</p>
</div>
</div>
<div id="outline-container-orgf9e3116" class="outline-3">
<h3 id="orgf9e3116"><span class="todo _WAITING_">[WAITING]</span> Reentrega - Actividad 2 - Gramaticas&#xa0;&#xa0;&#xa0;<span class="tag"><span class="sintaxis">sintaxis</span></span></h3>
</div>
<div id="outline-container-orgd6f7916" class="outline-3">
<h3 id="orgd6f7916"><span class="todo _WAITING_">[WAITING]</span> Actividad C 2 - Tipos, Operadores y Expresiones&#xa0;&#xa0;&#xa0;<span class="tag"><span class="sintaxis">sintaxis</span></span></h3>
<div class="outline-text-3" id="text-orgd6f7916">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2020-05-02 sáb&gt;</span></span></p>

<ul class="org-ul">
<li><a href="https://classroom.google.com/u/2/c/NTM3Mjk2MjYyNjZa/a/NzY3NTAzNjgyMDha/details">Ver Tp en el Aula Virtual</a></li>
<li><a href="https://classroom.google.com/u/2/c/NTM3Mjk2MjYyNjZa/m/NzE3MzUyNjIyODFa/details">Ver Teoria en el Aula Virtual</a></li>
</ul>
</div>
</div>
<div id="outline-container-org615ac0d" class="outline-3">
<h3 id="org615ac0d"><span class="todo _WAITING_">[WAITING]</span> Actividad C 2 - Ansi C&#xa0;&#xa0;&#xa0;<span class="tag"><span class="sintaxis">sintaxis</span></span></h3>
<div class="outline-text-3" id="text-org615ac0d">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2020-05-04 lun&gt;</span></span></p>

<ul class="org-ul">
<li><a href="https://classroom.google.com/u/2/c/NTM3Mjk2MjYyNjZa/a/NzY3NTAzNjgyMDha/details">Ver TP en el Aula Virtual</a></li>
<li><a href="https://classroom.google.com/u/2/c/NTM3Mjk2MjYyNjZa/m/NzE3MzUyNjIyODFa/details">Ver Teoria en el Aula Virtual</a></li>
</ul>
</div>
</div>

<div id="outline-container-org1b1f0bc" class="outline-3">
<h3 id="org1b1f0bc"><span class="done _DONE_">[DONE]</span> Actividad 1 - Lenguajes Formales&#xa0;&#xa0;&#xa0;<span class="tag"><span class="sintaxis">sintaxis</span></span></h3>
<div class="outline-text-3" id="text-org1b1f0bc">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2020-04-20 lun 02:04]</span></span></p>
</div>
</div>
<div id="outline-container-orgf5ee79c" class="outline-3">
<h3 id="orgf5ee79c"><span class="done _DONE_">[DONE]</span> Actividad 1 - Ansi C&#xa0;&#xa0;&#xa0;<span class="tag"><span class="sintaxis">sintaxis</span></span></h3>
<div class="outline-text-3" id="text-orgf5ee79c">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2020-04-14 mar 16:59]</span></span></p>
</div>
</div>
<div id="outline-container-orga7fa91b" class="outline-3">
<h3 id="orga7fa91b"><span class="done _DONE_">[DONE]</span> Actividad 2 - Gramaticas&#xa0;&#xa0;&#xa0;<span class="tag"><span class="sintaxis">sintaxis</span></span></h3>
<div class="outline-text-3" id="text-orga7fa91b">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2020-04-14 mar 16:48]</span></span></p>
</div>
</div>
</div>
<div id="outline-container-orgb0cf0d7" class="outline-2">
<h2 id="orgb0cf0d7">Cronograma dictado</h2>
<div class="outline-text-2" id="text-orgb0cf0d7">
<ol class="org-ol">
<li class="on"><code>[X]</code> Lenguajes Formales</li>
<li class="on"><code>[X]</code> Ansi C1</li>
<li class="on"><code>[X]</code> Gramaticas</li>
<li class="on"><code>[X]</code> Expresiones Regulares</li>
<li class="on"><code>[X]</code> BNF</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jelou</p>
<p class="date">Created: 2020-05-20 mié 17:12</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
